
&НаСервере
Процедура ЛБ_СообщитьГуидИДатуПослеНаСервере()
	
	ДокументОбъект 			= Объект.Ссылка.ПолучитьОбъект();
	ТекСтрокаДляВозврата 	= Строка(ДокументОбъект.ЛБ_Гуид) + " - " + Строка(ДокументОбъект.ЛБ_ДатаИзменения) + " это гуид через объект"+Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ССылка", Объект.Ссылка);
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказКлиента.ЛБ_Гуид КАК ЛБ_Гуид,
	               |	ЗаказКлиента.ЛБ_ДатаИзменения КАК ЛБ_ДатаИзменения
	               |ИЗ
	               |	Документ.ЗаказКлиента КАК ЗаказКлиента
	               |ГДЕ
	               |	ЗаказКлиента.Ссылка = &Ссылка";
	Выборка = Запрос.Выполнить().Выбрать();
	ДопСтрокаДляВозврата = "";
	
	Если Выборка.Следующий() Тогда
		
		ДопСтрокаДляВозврата 	= Строка(Выборка.ЛБ_Гуид) + " - " + Строка(Выборка.ЛБ_ДатаИзменения) + " это гуид через запрос"+Символы.ПС;	
		
	КонецЕсли;
	
	ТекСтрокаДляВозврата = ТекСтрокаДляВозврата + ДопСтрокаДляВозврата;
	Сообщить(ТекСтрокаДляВозврата);
	
КонецПроцедуры

&НаКлиенте
Процедура ЛБ_СообщитьГуидИДатуПосле(Команда)
	ЛБ_СообщитьГуидИДатуПослеНаСервере();
КонецПроцедуры
